Revit 2026 API

# DeleteElementsCreate(Document, ISetElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FailureResolution Create(
	Document document,
	ISet<ElementId> ids
)
```
```vb
Public Shared Function Create (
	document As Document,
	ids As ISet(Of ElementId)
) As FailureResolution
```
```cpp
public:
static FailureResolution^ Create(
	Document^ document,
	ISet<ElementId^>^ ids
)
```
```fsharp
static member Create :
        document : Document *
        ids : ISet<ElementId> -> FailureResolution
```

#### Parameters

document Document

ids ISetElementId

#### Return Value

FailureResolution

#### Reference

DeleteElements Class

Create Overload

Autodesk.Revit.DB Namespace